{
  "title": "RiverDogs Come Up Short in 4-3 Loss to Cannon Ballers",
  "subheadline": "",
  "date": "August 17, 2024",
  "content": "The Charleston RiverDogs allowed two unearned runs in the first inning which proved to be the difference in a 4-3 loss to the Kannapolis Cannon Ballers on Saturday night. The RiverDogs lead in the south division standings was trimmed to 2.5 games over Columbia.\n                        Both teams enjoyed hot starts offensively\nThe Charleston RiverDogs allowed two unearned runs in the first inning which proved to be the difference in a 4-3 loss to the Kannapolis Cannon Ballers on Saturday night. The RiverDogs lead in the south division standings was trimmed to 2.5 games over Columbia.\nBoth teams enjoyed hot starts offensively in the fifth game of the series. The RiverDogs (27-17, 54-55) wasted no time in grabbing the lead in the first inning. Adrian Santana drove a triple to dead center and immediately scored on Emilien Pitre’s single through the right side. Connor Hujsak doubled to left center in the next at-bat and the lead doubled to 2-0.\nIn the bottom of the first, Kannapolis (19-27, 60-52) answered right back. Sam Antonacci opened the inning with a double to center. With one out, Pitre fielded a groundball from Alex Makarewicz and threw wildly to first, allowing a run to score and the tying run to move to second. A groundball advanced the runner to third before Drake Logan tied the game with a sharp single through the right side.\nCharleston went without a hit from the first inning until the sixth, taking advantage when they finally did break through. Pitre pulled a base hit through the right side with one out in the frame and moved to second on a wild pitch. Hujsak came through once more, lining an RBI single down the left field line to make it 3-2 in favor of the road team.\nThe lead was relatively short-lived as has been the case throughout the series. Cade Halemanu walked the first two batters in the bottom of the seventh and paid for it when Alex Makarewicz doubled home both a deep fly ball to center that gave the Cannon Ballers a 4-3 lead. Alexander Alberto came on and retired the next three hitters to limit the damage.\nHalemanu took the loss after allowing two runs on three hits in one inning plus three batters. Santiago Suarez allowed only two unearned runs in 5.0 strong innings as the RiverDogs starting pitcher. Alberto worked 2.0 perfect innings with three strikeouts over the final 2.0 frames.\nKannapolis outhit the RiverDogs by an 11-5 margin. Makarewicz, Jeral Perez and Lyle Miller-Green each finished with two. Pitre and Hujsak were responsible for two hits each, combining for all three Charleston RBI.\nThe series concludes on Sunday afternoon with a doubleheader that begins at 1:30 p.m. LHP Jeremy Pilon will make his RiverDogs debut in the first game, while RHP Gerlin Rosario (1-1, 2.41) will start in the nightcap. Kannapolis will hand the ball to RHP Tanner McDougal (0-2, 3.86) in the first game. They have not yet announced a starter for the second game.",
  "url": "https://www.milb.com/charleston/news/riverdogs-come-up-short-in-4-3-loss-to-cannon-ballers",
  "images": [
    {
      "url": "https://www.mlbstatic.com/team-logos/233.svg",
      "width": "",
      "aspect_ratio": "",
      "type": "main"
    },
    {
      "url": "https://images.ctfassets.net/iiozhi00a8lc/t233_masthead_sponsor_imageCharleston_svg/1850b811f24653ef9c9407a23d273f4a/t233_masthead_sponsor_image",
      "width": "",
      "aspect_ratio": "",
      "type": "main"
    },
    {
      "url": "https://www.mlbstatic.com/team-logos/139.svg",
      "width": "",
      "aspect_ratio": "",
      "type": "main"
    },
    {
      "url": "https://img.mlbstatic.com/milb-images/image/upload/t_16x9/t_w2208/milb/gkrd6g19cc2d1c5zztsu",
      "width": "",
      "aspect_ratio": "",
      "type": "main"
    },
    {
      "url": "https://www.mlbstatic.com/team-logos/league-on-dark/milb-alt.svg",
      "width": "",
      "aspect_ratio": "",
      "type": "main"
    }
  ],
  "section": "news",
  "tags": {
    "topics": [],
    "teams": [
      "Charleston RiverDogs"
    ],
    "players": [],
    "contributors": [],
    "leagues": [
      "Carolina League"
    ]
  },
  "social_shares": {
    "facebook": "",
    "twitter": ""
  },
  "author": {},
  "last_updated": "2024-11-15T00:51:17.343041"
}